# 4.5 Data Consistency checks

In [2]:
# Importing libraries

In [3]:
import pandas as pd
import numpy as np
import os

In [4]:
path=r'C:\Users\samyf\Task 4.5_SFZ'

In [5]:
df_prods = pd.read_csv(os.path.join(path, 'Original Data', 'products.csv'), index_col = False)

In [6]:
df_ords = pd.read_csv(os.path.join(path, 'Original Data', 'orders.csv'), index_col = False)

# Check mixed-type data

In [ ]:
# Instacart data is already preped so we will practice fixing mixed-type data by creating a small test dataframe

In [ ]:
# Create a dataframe

In [14]:
df_test = pd.DataFrame()

In [15]:
#Create a mixed type column

In [16]:
df_test['mix'] = ['a', 'b', 1, True]

In [17]:
df_test.head()

    mix
0     a
1     b
2     1
3  True

In [18]:
# Check for any mixed-type columns
for col in df_test.columns.tolist():
    weird = (df_test[col].map(type) != df_test[col].iloc[0].__class__).any()
    if weird:
        print(col)

mix

In [19]:
# Convert column's data from numeric to string
df_test['mix'] = df_test['mix'].astype('str')

In [20]:
df_test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   mix     4 non-null      object
dtypes: object(1)
memory usage: 164.0+ bytes

In [ ]:
or

In [ ]:
df_test['mix'].dtype

In [22]:
## 04. Missing Values

In [23]:
# Find missing values (takes sum of Trues in a  column)
df_prods.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

In [24]:
# Create subset of the dataframe that contains the nulls
df_nan = df_prods[df_prods['product_name'].isnull() == True]

In [25]:
df_nan

       product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14    12.2
68             69          NaN        26              7    11.8
115           116          NaN        93              3    10.8
261           262          NaN       110             13    12.1
525           525          NaN       109             11     1.2
1511         1511          NaN        84             16    14.3
1780         1780          NaN       126             11    12.3
2240         2240          NaN        52              1    14.2
2586         2586          NaN       104             13    12.4
3159         3159          NaN       126             11    13.1
3230         3230          NaN       120             16    14.4
3736         3736          NaN        41              8    14.8
4283         4283          NaN        77              7    14.4
4790         4790          NaN        91             16    14.5
38187       38183          NaN        39             12    20.9
40444       40440          NaN       120             16    14.8

#### Addressing Missing Values

In [ ]:
There a few ways to deal with missing data:
1) Create a new variable that acts like a flag based on the missing value.
2) Impute the value with the mean or median of the column (if the variable is numeric).
3) Remove or filter out the missing data.

In [27]:
df_nan.describe()

         product_id    aisle_id  department_id     prices
count     16.000000   16.000000      16.000000  16.000000
mean    6684.000000   89.937500      10.937500  13.012500
std    12836.665242   33.731229       4.639953   3.881731
min       34.000000   26.000000       1.000000   1.200000
25%      459.250000   70.750000       7.750000  12.175000
50%     2413.000000   98.500000      11.500000  13.650000
75%     3872.750000  120.000000      14.500000  14.425000
max    40440.000000  126.000000      16.000000  20.900000

In [ ]:
# Ex: When using the mean, df['column with missings'].fillna(mean value, inplace=True)

In [28]:
df_nan.median()

product_id       2413.0
product_name        NaN
aisle_id           98.5
department_id      11.5
prices            13.65
dtype: object

In [ ]:
Ex: when using the median, df['column with missings'].fillna(median value, inplace=True)
Because the missing values are strings there's not much you can do other than remove/filter the data

In [29]:
# Find shape of df
df_prods.shape

(49693, 5)

In [30]:
# Create new df without the nulls
df_prods_clean = df_prods[df_prods['product_name'].isnull() == False]

In [31]:
# Should have exactly 16 less rows
df_prods_clean.shape

(49677, 5)

In [ ]:
To drop all missing values --> df_prods.dropna(inplace = True)
To drop only the NaNs from a particular column --> df_prods.dropna(subset = [‘product_name’], inplace = True)

In [33]:
# Duplicates

In [32]:
# Create subset of df_prods_clean that contains only rows of duplicates
df_dups = df_prods_clean[df_prods_clean.duplicated()]

In [34]:
df_dups

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8
18459,18458,Ranger IPA,27,5,9.2
26810,26808,Black House Coffee Roasty Stout Beer,27,5,13.4
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.8
35495,35491,Adore Forever Body Wash,127,11,9.9

In [35]:
# Check current number of rowns in df_prods_clean
df_prods_clean.shape

(49677, 5)

In [36]:
# Create datafram that doesn't include the duplicates
df_prods_clean_no_dups = df_prods_clean.drop_duplicates()

In [37]:
df_prods_clean_no_dups.shape

(49672, 5)

In [40]:
# Exportar df_prods
df_prods_clean_no_dups.to_csv(os.path.join(path,'Prepared Data', 'products_checked.csv'))

In [41]:
# Exportar df_ords
df_ords_clean_no_dups.to_csv(os.path.join(path,'Prepared Data', 'orders_checked.csv'))

# Task

In [46]:
df_prods.dtypes

product_id         int64
product_name      object
aisle_id           int64
department_id      int64
prices           float64
dtype: object

In [47]:
df_prods.describe()

         product_id      aisle_id  department_id        prices
count  49693.000000  49693.000000   49693.000000  49693.000000
mean   24844.345139     67.770249      11.728433      9.994136
std    14343.717401     38.316774       5.850282    453.519686
min        1.000000      1.000000       1.000000      1.000000
25%    12423.000000     35.000000       7.000000      4.100000
50%    24845.000000     69.000000      13.000000      7.100000
75%    37265.000000    100.000000      17.000000     11.200000
max    49688.000000    134.000000      21.000000  99999.000000

In [48]:
df_prods.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

In [49]:
df_prods.duplicated().sum()

5

In [50]:
# 2

In [51]:
df_ords.describe()

,order_id,user_id,order_number,order_dow,order_hour_of_day,days_since_prior_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

In [ ]:
The variable 'order_hour_of_day' has a range from 0 to 23, which is correct.
It would be important to investigate if there are extreme values in other variables such as 'days_since_prior_order', whose maximum value is 30.58. 
This value could be a bug or just a rare case

In [52]:
# 3

In [53]:
for col in df_ords.columns:
    if df_ords[col].dtypes == 'object':
        print(col, df_ords[col].apply(type).value_counts())

eval_set eval_set
<class 'str'>    3421083
Name: count, dtype: int64

In [54]:
# 4, 5

In [55]:
# Find missing values (takes sum of Trues in a  column)
df_ords.isnull().sum()

order_id                       0
user_id                        0
eval_set                       0
order_number                   0
order_dow                      0
order_hour_of_day              0
days_since_prior_order    206209
dtype: int64

In [ ]:
We find null values in the 'days_since_prior_order' column. 
This may be because certain users are new and have no previous purchase history.

In [59]:
# 6

In [60]:
# Create subset of the dataframe that contains the nulls
df_ords_nan = df_ords[df_ords['days_since_prior_order'].isnull() == True]

In [61]:
df_ords_nan

Empty DataFrame
Columns: [order_id, user_id, eval_set, order_number, order_dow, order_hour_of_day, days_since_prior_order]
Index: []

In [66]:
df_ords.duplicated().sum()

0

In [69]:
df_ords = df_ords.drop_duplicates()

In [74]:
df_ords[df_ords['order_number']==1]

,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order
0,2539329,1,prior,1,2,8,0.0
11,2168274,2,prior,1,2,11,0.0
26,1374495,3,prior,1,1,14,0.0
39,3343014,4,prior,1,6,11,0.0
45,2717275,5,prior,1,3,12,0.0
...,...,...,...,...,...,...,...
3420930,969311,206205,prior,1,4,12,0.0
3420934,3189322,206206,prior,1,3,18,0.0
3421002,2166133,206207,prior,1,6,19,0.0
3421019,2227043,206208,prior,1,1,15,0.0
3421069,3154581,206209,prior,1,3,11,0.0

In [75]:
# Create subset of df_ords that contains only rows of duplicates
df_ords_dups = df_ords[df_ords.duplicated()]

In [76]:
df_ords_dups

Empty DataFrame
Columns: [order_id, user_id, eval_set, order_number, order_dow, order_hour_of_day, days_since_prior_order]
Index: []

In [77]:
# Export

In [79]:
df_ords.to_csv(os.path.join(path, 'Prepared Data', 'orders_checked.csv'))

In [80]:
df_prods.to_csv(os.path.join(path, 'Prepared Data', 'prods_checked.csv'))